

#pragma once

#include "dlist.h"
#include "ks_eth.h"


#define ETH_RX_DATA				        1
#define ETH_TX_DATA				        2
#define ETH_TICK_STATUS				    4
#define ETH_LINK_STATUS				    8






/*********************************************************************************************************
*                                      EthData_SendFrame  
*
* Description:  ETH 驱动发送以太网包接口

* Arguments  : p_data: 发送数据pbuf_t指针 
*
*
* Returns    :  函数调用返回结果：成功 1
				

* Note(s)    :  函数为异步接口 ，实现不同TASK 之间的交互
				
*********************************************************************************************************/

int EthData_Send(uint8_t *p_data, uint32_t len);


/*********************************************************************************************************
*                                      EthData_AddRecvCallBack  
*
* Description:  ETH 驱动注册接收以太网包回调接口

* Arguments  : cb_func:  接收回调函数
*
*            
*
* Returns    :  函数调用返回结果：成功 0 失败 -1
				

* Note(s)    :  目前支持最多添加4个
				
*********************************************************************************************************/

int EthData_AddRecvCallBack(EthDataCbk cb_func);

/*********************************************************************************************************
*                                      EthStatus_AddChangeCallBack  
*
* Description:  ETH 驱动注册网络链接状态变化回调接口

* Arguments  : cb_func:  接收回调函数
*
*            
*
* Returns    :  函数调用返回结果：成功 0 失败 -1
				

* Note(s)    :  目前支持最多添加4个
				
*********************************************************************************************************/

int EthStatus_AddChangeCallBack(EthStatusCbk cb_func);

/*********************************************************************************************************
*                                      EthGetMac  
*
* Description:  ETH 驱动获取以太网MAC 接口

* Arguments  : 
*            
*
* Returns    :  mac 输出
*
				

* Note(s)    :  
				
*********************************************************************************************************/

uint8_t* EthGetMac();


/*********************************************************************************************************
*                                      EthData_GetSendBuffer  
*
* Description: 发送队列中获取发送buffer,减少拷贝次数，提高发送效率

* Arguments  : 
*            
*
* Returns    :  
*
				

* Note(s)    :  
				
*********************************************************************************************************/

int EthData_GetSendBuffer(eth_pkt_buf** pbuffer);

/*********************************************************************************************************
*                                      EthData_FlagSendTask  
*
* Description:

* Arguments  : 
*            
*
* Returns    :  
*
				

* Note(s)    :  
				
*********************************************************************************************************/

int EthData_FlagSendTask();


/*********************************************************************************************************
*                                      InitEth  
*
* Description:  InitEth 初始化以太网驱动接口

* Arguments  :  参数  6位   mac 地址
     
*
* Returns    :  
				
* Note(s)    :  
				
*********************************************************************************************************/

void EthInit(uint8_t* mac);


